import{_ as i,p as r,q as s,w as n,s as e,R as a,t as o,Y as h,n as c}from"./framework-aa5c4115.js";const l={},u=h('<h2 id="关于博客" tabindex="-1"><a class="header-anchor" href="#关于博客" aria-hidden="true">#</a> 关于博客</h2><p>我的博客是一个分享个人学习、技术经验和生活见闻的平台。通过这个博客，我希望能够记录自己的成长历程，并与读者分享有趣和有价值的内容。</p><h2 id="关于命名" tabindex="-1"><a class="header-anchor" href="#关于命名" aria-hidden="true">#</a> 关于命名</h2><p>博客本身是叫<code>黄金的博客~</code>,后来改为<code>huangjin999</code>,并没有其他的什么意思，可能是对黄金的喜感，现在名字是<code>杪冬十六</code>，正如主页小写介绍一样，他是农历腊月二十六的意思，我的生日。</p><h2 id="内容分类" tabindex="-1"><a class="header-anchor" href="#内容分类" aria-hidden="true">#</a> 内容分类</h2><ul><li>技术文章</li><li>生活感悟</li><li>学习笔记</li><li>日记记录</li></ul><h2 id="如何使用" tabindex="-1"><a class="header-anchor" href="#如何使用" aria-hidden="true">#</a> 如何使用</h2><p>欢迎使用我的博客！以下是一些简要的使用说明：</p><ul><li><strong>导航：</strong> 使用顶部导航栏浏览不同的博客分类。</li><li><strong>搜索：</strong> 在右上角的搜索框中输入关键词，以查找特定主题的博客。</li><li><strong>评论：</strong> 欢迎在每篇博客下方留下您的评论和想法。</li></ul><h2 id="联系我" tabindex="-1"><a class="header-anchor" href="#联系我" aria-hidden="true">#</a> 联系我</h2><p>如果您对博客的内容有任何疑问或建议，请随时与我联系：</p><ul><li>电子邮件：876710916@qq.com</li><li>Twitter：</li></ul><h2 id="博客历史" tabindex="-1"><a class="header-anchor" href="#博客历史" aria-hidden="true">#</a> 博客历史</h2><p>这个博客创建于2023年，域名为 <code>shenluwei.cn</code> 经过多次更新和改进。一直在努力提供有趣且有价值的内容。</p><h2 id="未来计划" tabindex="-1"><a class="header-anchor" href="#未来计划" aria-hidden="true">#</a> 未来计划</h2><p>我们计划在未来增加更多关于技术方面的文章，同时改进用户体验和界面设计。</p>',16),d={id:"我的-数据大屏",tabindex:"-1"},x=e("a",{class:"header-anchor",href:"#我的-数据大屏","aria-hidden":"true"},"#",-1),p={href:"https://huangjin999.github.io/charts/",target:"_blank",rel:"noopener noreferrer"};function m(_,v){const t=c("ExternalLinkIcon");return r(),s("div",null,[u,n(` ## **个人信息**
- 姓名：
- 工作年限：
- 电话/微信：17357425260
- 邮箱：shen16@aliyun.com / 876710916@qq.com
- 实在想看右键源代码能看
### 我的： [Github](https://github.com/huangjin999)  
### 我的： [掘金](https://juejin.cn/user/4130238635182046)  `),e("h3",d,[x,a(" 我的： "),e("a",p,[a("数据大屏"),o(t)])]),n(` - 手机 / 微信：17357425260｜ 邮箱：shen16@aliyun.com 
- 23岁 | 男 | 地址：XXX
- 离职 随时到岗 | 求职意向 ：Web前端开发工程师 | 期望薪资：面议 `),n(` ## 求职意向
- 岗位 ：web前端开发
- 目前状态：随时入职
- 期望薪资：面议
## 专业技能

- 掌握前端基础知识 HTML5 、CSS3、 ES6相关新特性可根据 UI 设计稿快速完成网页开发;
- 掌握 Less，Scss，移动端布局，Rem布局，百分比布局等；
- 掌握原生 JS ，闭包，以及 promise 异步解决方案；
- 熟练使用 Vue2 全家桶，vue-cli 脚手架 ，vant2 ，element-Ui 等，对 Axios 进行二次封装；
- 熟练使用 Vue3 全家桶 ，包括（vite，vue-router4，pinia ， element-Plus） ；
- 熟练使用 uni-app 和微信开发者工具，进行webapp应用和小程序的开发；
- 熟悉 node.js，能够利用koa框架开发后端接口；
- 熟练使用 Git 等管理工具，和团队进行协同开发；
- 熟悉 webpack 构建工具及常用配置；
- 具备良好的沟通协调能力和团队合作精神，良好的学习、动手以及解决问题的能力；


## 工作经历

**xxxxx**
 - 根据工作安排高效、高质地完成代码编写进行项目管理，确保前端代码规范； 
 - 根据产品需求，对接UI设计和后端开发，实现产品界面和功能；
 - 负责公司PC端，移动端和管理系统的开发；
 - 负责公司现有项目的维护和新项目开发工作；
## 项目经历
### Vue3 + Echarts大屏可视化项目（个人开源）[点击访问](/charts)

### 查网课知识 （个人开源）
**技术栈：** \`Vue2\`  \`Uniapp\` 

**描述：** 小程序为大学生提供免费的考试答案，采用 uniapp 实现：
- 1. 顶部为文本域搜索框进行拍照搜索和文字搜索以及语音搜索；
- 2. button按钮网络请求的时候调取数据；
- 3. 底部为卡片添加联系方式以及公告；
- 4. 个人页面获取用户信息；

### 项目一：IOT物联设备管理系统（Vue3+Element-Plus）
**技术栈：** \`vite\` \`vue3\` \`vue-router4\` \`pinia\` \`axios\` \`Element-Plus\` 

**项目描述**：
- 项目采用 Vue3 和 vite 以及 Element-Plus 搭建，是对物联设备的后台管理系统，可以将各种设备统一化管理，包含设备管理模块，对设备的上架和下架以及禁用锁定；设备接入模块，设备监测模块，利用了echarts实现数据可视化；通知和日志管理模块、系统权限设置，不同人员分配不同的权限。在模块开发的同时进行合理拆分提高效率；基于 axios 对网络请求进行二次封装和后端数据交互；基于Element Plus 进行二次封装业务组件，这样不仅统一了各个业务模块的 ui 交互，而且减少了 30% 左右的开发时间，大大降低了研发成本。

**项目职责**：
- 负责实现首页设备监测模块，设备接入模块，系统权限管理，日志管理模块的开发；
- 权限控制 : 负责基于前端的权限设计，通过请求到后端关键字段信息，判断登录用户能够看到的菜单，动态注册路由，实现管理控制各级用户的路由访问权限；
- 网络请求 : 封装 axios 进行网络请求，实现了对网络请求部分的完全封装;
- 项目首页采用 echarts 图表进行可视化实现，利用饼图展示设备监测情况；
- 全局自定义指令 focus 输入框自动聚焦，实现页面刷新光标自动聚焦；
- 对 SVG 矢量图标的使用进行组件化封装，单页面刷新功能，以及全屏展示，进度条的开启和关闭；
- 对日志相关的数据进行批量导出以及按照条件进行导出excel表格；

### 项目二：废有所值（小程序）
**技术栈：** \`vue2\` \`vuex3\` \`vant2\` \` vue-router3\`   

**项目描述**：
 废有所值是针对大众进行废物回收开发的一款小程序，包括废物回收模块、家政服务模块、闲置快卖模块，预约服务模块以及合伙人加入。家政服务模块可以预约各项服务比如卫生打扫等，闲置快卖模块用户还可进行发布商品，以及商品的购买，实现用户和用户之间的商品交易。

 **项目职责**：
- 根据 UI 设计图进行布局和页面搭建，使用vant2 配合 wxml 和 wxss 实现页面结构样式；
- 通过调用微信 wx.reqeust 来进行网络请求；
- 使用 wx.login 实现用户授权登录，包含用户名称，用户头像，用户手机号等信息获取；
- 接入腾讯地图获取用户当前的位置信息，支付设置对接了微信支付功能；
- 实现小程序分包，按需加载分包，配置分包预下载，开启分包优化;
- 使用 setTimeout 对用户搜索栏输入框做防抖处理、使用图片懒加载和路由懒加载提高性能；
 - 封装自定义数字键盘，解决部分手机弹出系统密码键盘的延迟，在不调用系统密码键盘的同时只显示出数字键盘，提高用户体验；

### 项目三 : 水务管控一体化平台（PC）
**技术栈：** \`vue2\` \`vuex3\` \`element-ui\` \`vue-router3\`

**项目描述：**
该项目是针对社区居民的用水情况，用水量分析管理的系统；主要包含用户缴费模块，该模块可以便捷查看用户缴费相关信息；表档管理模块，该模块是保存历史数据利用vue-json-excel导出用户个人信息等；用户管理模块，区分了各个单元和楼栋之间用户统一化管理；结算管理模块，用户进行网上缴费之后便捷查看；区域管理模块，实现小区之间楼栋之间的区分；水价组成模块，可以区分商业用水和普通居民用水的价格；该项目的首页还加入了 echarts 图表，优化了一些用水的数据分析，包含用户冬季和夏季的用水量分析折线图，区域用水量饼图等，体现了水务体统的智能化。

**项目职责：**
- 负责水价组成管理，首页开发 echarts 图表展示数据，和区域管理；
- 二次封装axios，简化了前后端交互的代码，便于发送请求；
- 实现权限的设置，控制用户访问权限；
- 使用 vuex 状态管理，管理全局状态，存储用户信息，提高开发效率；
- 导出excel表格，基于vue-json-excel实现 excel 的按需导出和全部导出；
- 优化数据太多导致加载太慢的问题，使用分页加载，从而实现分批次的加载数据，避免页面卡顿；
- 实现管理系统全局组件切换大小，全局主题切换，提高用户体验；
- 使用echarts图表实现首页数据可视化，包含用户用水量分析折线图，区域用水量饼图等；
## 教育经历
- 周口师范学院 - 计算机科学与技术 - 本科
- 周口职业技术学院 - 计算机应用技术 - 专科

## 总结
- 有自己的个人博客 shenluwei.cn，同时具有规范的代码编写风格和高效的工作习惯；
- 自我学习能力强，能够通过阅读文档快速了解和使用新技，尤其喜欢逛掘金、GitHub等； `)])}const f=i(l,[["render",m],["__file","index.html.vue"]]);export{f as default};
